import React from "react";
import { Link } from "react-router-dom";

const PopupRegisterAgreement = () => (
    <div id="popup-register-agreement" className="popup">
        <div className="popup-body">
            <div className="popup-content popup-content_big">
                <div className="popup__close close-popup">x</div>
                <div className="popup__title">Пользовательское соглашение</div>
                <div className="popup-policy">
                    <div className="popup-policy-block">
                        <div className="popup-policy-block__text">
                            <p>
                                Физическое лицо Лапов Николай Андреевич, дата рождения 04.09.1988,
                                именуемый в дальнейшем Правообладатель, адресует настоящее
                                Соглашение (далее по тексту - Соглашение) любому лицу
                                (неопределенному кругу лиц), выразившему готовность заключить
                                договор на изложенных ниже условиях (далее по тексту -
                                Пользователь). Данное Соглашение, согласно п. 2 ст. 437 Гражданского
                                кодекса Российской Федерации, является публичной офертой, принятием
                                условий (акцептом) которой является совершение действий,
                                предусмотренных Соглашением.
                            </p>
                        </div>
                    </div>
                    <div className="popup-policy-block">
                        <div className="popup-policy-block__title">1.Определения</div>
                        <div className="popup-policy-block__text">
                            <p>
                                1.1. Условия Соглашения регулируют отношения Правообладателя и
                                Пользователя и содержат следующие определения:
                            </p>
                            <p>
                                1.1.1. Оферта — настоящий документ (Соглашение), размещенный в сети
                                Интернет по ряду адресов:
                                <Link to="#">http://gotruenet.com/</Link>;
                                <Link to="#">http://gotruenet.ru/</Link>;
                                <Link to="#">http://gotruenet.in/</Link>;
                                <Link to="#">http://gotruenet.net/</Link>;
                                <Link to="#">http://gotruenet.cn/</Link>;
                                <Link to="#">http://gotruenet.eu/</Link>
                            </p>
                            <p>
                                1.1.2. Акцепт — полное и безоговорочное принятие оферты путем
                                осуществления действий, указанных в п. 3.1 Соглашения.
                            </p>
                            <p>
                                1.1.3. Правообладатель – физическое лицо Лапов Николай Андреевич,
                                разместивший оферту.
                            </p>
                            <p>
                                1.1.4. Пользователь — юридическое или дееспособное физическое лицо,
                                заключившее Соглашение посредством акцепта на условиях, содержащихся
                                в оферте.
                            </p>
                            <p>
                                1.1.5. Интернет-сайт - совокупность веб-страниц, размещенных на
                                виртуальном сервере и образующих единую структуру, расположен в сети
                                Интернет по следующим адресам:
                                <Link to="#">http://gotruenet.com/</Link>;
                                <Link to="#">http://gotruenet.ru/</Link>;
                                <Link to="#">http://gotruenet.in/</Link>;
                                <Link to="#">http://gotruenet.net/</Link>;
                                <Link to="#">http://gotruenet.cn/</Link>;
                                <Link to="#">http://gotruenet.eu/</Link>
                                (далее по тексту - Сайт).
                            </p>
                            <p>
                                1.1.6. Контент - информация, представленная в текстовом,
                                графическом, аудиовизуальном (видео) форматах на Сайте, являющаяся
                                его наполнением. Контент Сайта распределяется на основной –
                                пользовательский, и вспомогательный – административный, который
                                создает Правообладатель для облегчения функционирования Сайта,
                                включая интерфейс Сайта.
                            </p>
                            <p>
                                1.1.7. Простая (неисключительная) лицензия - неисключительное право
                                Пользователя использовать результат интеллектуальной деятельности,
                                указанный в п. 2.1 Соглашения, с сохранением за Правообладателем
                                права выдачи лицензий другим лицам.
                            </p>
                            <p>
                                1.1.8. Личный кабинет – это виртуальный инструмент персонального
                                самообслуживания Правообладателя, расположенный на официальном
                                интернет-сайте (сайтах): http://gotruenet.com/;
                                <Link to="#">http://gotruenet.com/</Link>;
                                <Link to="#">http://gotruenet.ru/</Link>;
                                <Link to="#">http://gotruenet.in/</Link>;
                                <Link to="#">http://gotruenet.net/</Link>;
                                <Link to="#">http://gotruenet.cn/</Link>;
                                <Link to="#">http://gotruenet.eu/</Link>
                            </p>
                            <p>
                                1.1.9. Личная учетная запись Пользователя – уникальный логин и
                                пароль для входа в личный кабинет.
                            </p>
                        </div>
                    </div>
                    <div className="popup-policy-block">
                        <div className="popup-policy-block__title">2.Предмет Соглашения</div>
                        <div className="popup-policy-block__text">
                            <p>
                                2.1. Настоящее Соглашение определяет условия и порядок использования
                                результатов интеллектуальной деятельности, в том числе элементов
                                контента Веб-сайта (веб-сайтов), расположенного (ых) в сети Интернет
                                по адресам: http://gotruenet.com/;
                                <Link to="#">http://gotruenet.com/</Link>;
                                <Link to="#">http://gotruenet.ru/</Link>;
                                <Link to="#">http://gotruenet.in/</Link>;
                                <Link to="#">http://gotruenet.net/</Link>;
                                <Link to="#">http://gotruenet.cn/</Link>;
                                <Link to="#">http://gotruenet.eu/</Link>
                                (далее по тексту - Сайт), ответственность Сторон и другие
                                особенности функционирования Сайта и взаимоотношений Пользователей
                                Сайта с Правообладателем, а также друг с другом.
                            </p>
                            <p>
                                2.2.Правообладатель гарантирует, что он является правообладателем
                                исключительных прав на Сайт, указанный в п. 2.1 Соглашения.
                            </p>
                        </div>
                    </div>
                    <div className="popup-policy-block">
                        <div className="popup-policy-block__title">
                            3.Согласие с условиями соглашения
                        </div>
                        <div className="popup-policy-block__text">
                            <p>
                                3.1.Акцептом (принятием оферты) является нажатие Пользователем
                                кнопки (чек-поинта) "Принимаю пользовательское соглашение".
                            </p>
                            <p>
                                3.2. Совершая действия по принятию оферты в порядке, определенном п.
                                3.1 Соглашения, Пользователь гарантирует, что ознакомлен,
                                соглашается, полностью и безоговорочно принимает все условия
                                Соглашения, обязуется их соблюдать.
                            </p>
                            <p>
                                3.3.Настоящим Пользователь подтверждает, что акцепт (совершение
                                действий по принятию оферты) равносилен подписанию и заключению
                                Соглашения на условиях, изложенных в настоящем Соглашении.
                            </p>
                            <p>
                                3.4. Оферта вступает в силу с момента размещения в сети Интернет по
                                адресам: http://gotruenet.com/;
                                <Link to="#">http://gotruenet.com/</Link>;
                                <Link to="#">http://gotruenet.ru/</Link>;
                                <Link to="#">http://gotruenet.in/</Link>;
                                <Link to="#">http://gotruenet.net/</Link>;
                                <Link to="#">http://gotruenet.cn/</Link>;
                                <Link to="#">http://gotruenet.eu/</Link>и действует до момента
                                отзыва оферты.
                            </p>
                            <p>
                                3.5.Настоящее Соглашение размещено в письменном виде на Сайте. В
                                случае необходимости любому лицу по его запросу может быть
                                предоставлена возможность ознакомиться с бумажной версией Соглашения
                                в офисе Правообладателя.
                            </p>
                            <p>
                                3.6. Соглашение может быть принято исключительно в целом (п. 1 ст.
                                428 Гражданского кодекса Российской Федерации). После принятия
                                Пользователем условий настоящего Соглашения оно приобретает силу
                                договора, заключенного между Правообладателем и Пользователем, при
                                этом такой договор как бумажный документ, подписанный обеими
                                Сторонами, не оформляется.
                            </p>
                            <p>
                                3.7. Для организации взаимодействия между Правообладателем и
                                Пользователем Пользователь самостоятельно регистрирует личный
                                кабинет в порядке совершения ряда последовательных действий по
                                заполнению регистрационного бланка в электронной форме, в результате
                                которых такое лицо становится зарегистрированным Пользователем,
                                получает индивидуальный логин и пароль для осуществления доступа ко
                                всем возможностям Сайта.
                            </p>
                            <p>
                                3.8. В Личном кабинете Пользователя указывается следующая информация
                                о Пользователе: имя Пользователя и адрес электронной почты (e-mail).
                            </p>
                            <p>
                                3.9. Правообладатель оставляет за собой право вносить изменения в
                                настоящее Соглашение без какого-либо специального уведомления, в
                                связи с чем Пользователь обязуется регулярно отслеживать изменения в
                                Соглашении. Новая редакция Соглашения вступает в силу с момента ее
                                размещения на данной странице, если иное не предусмотрено новой
                                редакцией Соглашения. Действующая редакция Соглашения всегда
                                находится на главной странице в разделе «Регистрация» по адресам:
                                http://gotruenet.com/;
                                <Link to="#">http://gotruenet.com/</Link>;
                                <Link to="#">http://gotruenet.ru/</Link>;
                                <Link to="#">http://gotruenet.in/</Link>;
                                <Link to="#">http://gotruenet.net/</Link>;
                                <Link to="#">http://gotruenet.cn/</Link>;
                                <Link to="#">http://gotruenet.eu/</Link>
                            </p>
                            <p>
                                3.10 Для принятия пожертвований (донатов) используется сервис
                                donationalerts, расположенный на сайте
                                https://www.donationalerts.com/, и производится путем перечисления
                                Пользователем денежных средств одним из представленных на сайте
                                способов на банковскую карту Правообладателя. Для осуществления
                                пожертвований предусмотрена кнопка «Поддержите проект» на главной
                                странице по адресам: http://gotruenet.com/;
                                <Link to="#">http://gotruenet.com/</Link>;
                                <Link to="#">http://gotruenet.ru/</Link>;
                                <Link to="#">http://gotruenet.in/</Link>;
                                <Link to="#">http://gotruenet.net/</Link>;
                                <Link to="#">http://gotruenet.cn/</Link>;
                                <Link to="#">http://gotruenet.eu/</Link>
                            </p>
                            <p>
                                3.12 Вознаграждение за осуществление пожертвований с использованием
                                сервиса «donationalerts» взимается с Пользователя согласно Условиям
                                оплаты, размещенными на сайте https://www.donationalerts.com в сети
                                Интернет по адресу
                                https://www.donationalerts.com/terms-of-service/payments
                            </p>
                        </div>
                    </div>
                    <div className="popup-policy-block">
                        <div className="popup-policy-block__title">
                            4.Права и обязанности сторон
                        </div>
                        <div className="popup-policy-block__text">
                            <p>4.1.Правообладатель обязуется:</p>
                            <p>
                                4.1.1. В течение 30 календарных дней со дня получения
                                соответствующего письменного уведомления Пользователя своими силами
                                и за свой счет устранить выявленные Пользователем недостатки Сайта,
                                а именно: - несоответствие содержания Сайта данным, указанным в п.
                                2.1 Соглашения; - наличие в составе Сайта материалов, запрещенных к
                                распространению законодательством.
                            </p>
                            <p>
                                4.1.2. Воздерживаться от каких-либо действий, способных затруднить
                                осуществление Пользователем предоставленного ему права использования
                                Сайта в установленных Соглашением пределах.
                            </p>
                            <p>
                                4.1.3.Предоставлять информацию по вопросам работы с Сайтом
                                посредством обратной связи через форму «Пожелания и предложения»,
                                расположенных на главной странице по адресам: http://gotruenet.com/;
                                <Link to="#">http://gotruenet.com/</Link>;
                                <Link to="#">http://gotruenet.ru/</Link>;
                                <Link to="#">http://gotruenet.in/</Link>;
                                <Link to="#">http://gotruenet.net/</Link>;
                                <Link to="#">http://gotruenet.cn/</Link>;
                                <Link to="#">http://gotruenet.eu/</Link>
                            </p>
                            <p>
                                4.1.4. Использовать все личные данные и иную конфиденциальную
                                информацию о Пользователе только для оказания услуг в соответствии с
                                Соглашением, не передавать третьим лицам находящуюся у него
                                документацию и информацию о Пользователе.
                            </p>
                            <p>
                                4.1.5. Обеспечивать конфиденциальность информации, введенной
                                Пользователем при использовании Сайта через личную учетную запись
                                Пользователя, за исключением случаев размещения такой информации в
                                общедоступных разделах Сайта.
                            </p>
                            <p>
                                4.1.6. Консультировать Пользователя по всем вопросам, касающимся
                                Сайта. Сложность вопроса, объем, и сроки консультирования
                                определяются в каждом конкретном случае Правообладателем
                                самостоятельно.
                            </p>
                        </div>
                    </div>
                    <div className="popup-policy-block">
                        <div className="popup-policy-block__title">4.2.Пользователь обязуется:</div>
                        <div className="popup-policy-block__text">
                            <p>
                                4.2.1.Использовать Сайт только в пределах тех прав и теми способами,
                                которые предусмотрены в Соглашении.
                            </p>
                            <p>
                                4.2.2. При регистрации в Личном кабинете предоставить реальные, а не
                                вымышленные сведения. В случае обнаружения недостоверности
                                представленных сведений, а также если у Правообладателя возникнут
                                обоснованные сомнения в их достоверности (в том числе, при попытке
                                связаться указанные контактные данные окажутся несуществующими),
                                Правообладатель имеет право в одностороннем порядке прекратить
                                отношения с Пользователем, удалить учетную запись Пользователя и
                                заблокировать доступ на Сайт.
                            </p>
                            <p>
                                4.2.3. Хранить в тайне и не раскрывать третьим лицам информацию о
                                своем пароле, дающем доступ в Личный кабинет Пользователя. В случае,
                                если такая информация по тем или иным причинам станет известна
                                третьим лицам, Пользователь обязуется немедленно изменить его.
                            </p>
                            <p>
                                4.2.4. Строго придерживаться и не нарушать условий Соглашения, а
                                также обеспечить конфиденциальность полученной при сотрудничестве с
                                Правообладателем коммерческой и технической информации.
                            </p>
                            <p>
                                4.2.5. Воздерживаться от копирования в любой форме, а также от
                                изменения, дополнения, распространения Сайта, контента Сайта (либо
                                любой его части), а также воздерживаться от создания на его основе
                                производных объектов без предварительного письменного разрешения
                                Правообладателя.
                            </p>
                            <p>
                                4.2.6. Не использовать никаких приборов либо компьютерных программ
                                для вмешательства или попытки вмешательства в процесс нормального
                                функционирования Сайта.
                            </p>
                            <p>
                                4.2.7. Незамедлительно информировать Правообладателя обо всех
                                ставших ему известных фактах противоправного использования Сайта
                                третьими лицами.
                            </p>
                            <p>
                                4.2.8. Использовать Сайт, не нарушая имущественных и/или личных
                                неимущественных прав третьих лиц, а равно запретов и ограничений,
                                установленных применимым правом, включая без ограничения: авторские
                                и смежные права, права на товарные знаки, знаки обслуживания и
                                наименования мест происхождения товаров, права на промышленные
                                образцы, права на использование изображений людей.
                            </p>
                            <p>
                                4.2.9. Не допускать размещение и передачу материалов незаконного,
                                неприличного, клеветнического, дискредитирующего, угрожающего,
                                порнографического, враждебного характера, а также содержащих
                                домогательства и признаки расовой или этнической дискриминации,
                                призывающих к совершению действий, которые могут считаться уголовным
                                преступлением или являться нарушением какого-либо законодательства,
                                равно как и считаться недопустимыми по иным причинам, материалов,
                                пропагандирующих культ насилия и жестокости, материалов, содержащих
                                нецензурную брань.
                            </p>
                            <p>
                                4.2.10. Не распространять рекламные материалы в личных сообщениях
                                иным Пользователям без получения их предварительного согласия на
                                получение таких материалов (СПАМ).
                            </p>
                            <p>4.2.11. Исполнять иные обязанности, предусмотренные Соглашением.</p>
                        </div>
                    </div>
                    <div className="popup-policy-block">
                        <div className="popup-policy-block__title">4.3.Правообладатель вправе:</div>
                        <div className="popup-policy-block__text">
                            <p>
                                4.3.1.Приостановить или прекратить регистрацию и доступ Пользователя
                                на Сайт, если Правообладатель будет обоснованно считать, что
                                Пользователь ведет неправомерную деятельность.
                            </p>
                            <p>
                                4.3.2. Собирать информацию о предпочтениях Пользователей и способах
                                использования ими Сайта (наиболее часто используемые функции,
                                настройки, предпочитаемое время и продолжительность работы с Сайтом
                                и прочее), которая не является персональными данными, для улучшения
                                работы Сайта, диагностики и профилактики сбоев Сайта.
                            </p>
                            <p>
                                4.3.3.Вносить в одностороннем порядке изменения в Соглашение путем
                                издания его новых редакций.
                            </p>
                            <p>
                                4.3.4. Удалять пользовательский контент по требованию уполномоченных
                                органов или заинтересованных лиц в случае, если данный контент
                                нарушает применимое законодательство или права третьих лиц.
                            </p>
                            <p>
                                4.3.5. Временно прекращать работу Сайта, а равно частично
                                ограничивать или полностью прекращать доступ к Сайту до завершения
                                необходимого технического обслуживания и (или) модернизации Сайта.
                                Пользователь не вправе требовать возмещения убытков за такое
                                временное прекращение оказания услуг или ограничение доступности
                                Сайта.
                            </p>
                        </div>
                    </div>
                    <div className="popup-policy-block">
                        <div className="popup-policy-block__title">4.4.Пользователь вправе:</div>
                        <div className="popup-policy-block__text">
                            <p>
                                4.4.1.Использовать Сайт в пределах и способами, предусмотренными
                                Соглашением.
                            </p>
                            <p>
                                4.5. Пользователь не вправе давать согласие на выполнение настоящего
                                Соглашения в случаях, если у него нет законного права использовать
                                Сайт в стране, в которой находится или проживает, или если он не
                                достиг возраста, с которого имеет право заключать данное Соглашение.
                            </p>
                        </div>
                    </div>
                    <div className="popup-policy-block">
                        <div className="popup-policy-block__title">
                            5.Условия и порядок использования
                        </div>
                        <div className="popup-policy-block__text">
                            <p>
                                5.1. При условии выполнения Пользователем настоящего Соглашения,
                                Пользователю предоставляется простая (неисключительная) лицензия на
                                использование Сайта с помощью персонального компьютера, мобильного
                                телефона или другого устройства, в объеме и порядке, установленном
                                Соглашением, без права предоставления сублицензий и переуступки.
                            </p>
                            <p>
                                5.2. В соответствии с условиями Соглашения Правообладатель
                                предоставляет Пользователю право использования Сайта следующими
                                способами:
                            </p>
                            <p>
                                5.2.1.Использовать Сайт для просмотра, ознакомления, оставления
                                комментариев и иных записей и реализации иного функционала Сайта, в
                                том числе путем воспроизведения на мониторе (экране)
                                соответствующего технического средства Пользователя;
                            </p>
                            <p>
                                5.2.2. Кратковременно загружать в память ЭВМ для целей использования
                                Сайта и его функционала;
                            </p>
                            <p>
                                5.2.3. Цитировать элементы пользовательского контента Сайта с
                                указанием источника цитирования, включающего ссылку на URL-адрес
                                Сайта.
                            </p>
                            <p>
                                5.3. Пользователь не вправе предпринимать указанные ниже действия
                                при использовании Сайта, а равно любых составных частей Сайта:
                            </p>
                            <p>
                                5.3.1. Модифицировать или иным образом перерабатывать Сайт, в том
                                числе, осуществлять перевод на другие языки.
                            </p>
                            <p>
                                5.3.2. Копировать, распространять или перерабатывать материалы и
                                сведения, содержащиеся на Сайте, за исключением случаев, когда это
                                необходимо и вызвано реализацией функционала, доступного как
                                конкретному Пользователю.
                            </p>
                            <p>
                                5.3.3. Нарушать целостность защитной системы или осуществлять
                                какие-либо действия, направленные на обход, снятие или деактивацию
                                технических средств защиты; использовать какие-либо программные
                                коды, предназначенные для искажения, удаления, повреждения, имитации
                                или нарушения целостности Сайта, передаваемой информации или
                                протоколов.
                            </p>
                            <p>
                                5.4. Любые права, не предоставленные Пользователю в явной форме в
                                соответствии с настоящим Соглашением, сохраняются за
                                Правообладателем.
                            </p>
                            <p>
                                5.5. Сайт предоставляется Правообладателем в состоянии «Как есть»
                                ("AS IS"), без гарантийных обязательств Правообладателя или
                                какой-либо обязанности по устранению недостатков, эксплуатационной
                                поддержке и усовершенствованию.
                            </p>
                            <p>
                                5.6. В отношении пользовательского контента Пользователь
                                гарантирует, что является владельцем или обладает необходимыми
                                лицензиями, правами, согласием и разрешениями на использование и
                                предоставление Правообладателю права использовать весь
                                пользовательский контент в соответствии с настоящим Соглашением; у
                                него имеется письменное согласие и (или) разрешение каждого лица,
                                так или иначе присутствующего в пользовательском контенте,
                                использовать персональные данные (включая изображение при
                                необходимости) этого лица для того, чтобы размещать и использовать
                                пользовательский контент способом, предусмотренным настоящим
                                Соглашением.
                            </p>
                            <p>
                                5.7. Принимая условия настоящего Соглашения, Пользователь
                                безвозмездно предоставляет Правообладателю и другим Пользователям
                                неисключительное безвозмездное право использования (простую
                                лицензию) материалов, которые Пользователь добавляет (размещает) на
                                Сайте в разделах, предназначенных для доступа всех или части
                                Пользователей (чаты, обсуждения, комментарии и прочее). Указанные
                                право и/или разрешение на использование материалов предоставляются
                                одновременно с добавлением Пользователем таких материалов на Сайт на
                                весь срок действия исключительных прав на объекты интеллектуальной
                                собственности или защиты неимущественных прав на указанные материалы
                                для их использования на территории всех стран мира.
                            </p>
                        </div>
                    </div>
                    <div className="popup-policy-block">
                        <div className="popup-policy-block__title">
                            6.Персональные данные и политика конфиденциальности
                        </div>
                        <div className="popup-policy-block__text">
                            <p>
                                6.1. Для выполнения условий Соглашения Пользователь соглашается
                                предоставить и дает согласие на обработку персональных данных в
                                соответствии с Федеральным законом от 27.07.2006 года №152-ФЗ «О
                                персональных данных» на условиях и для целей надлежащего исполнения
                                Соглашения. Под «персональными данными» понимается персональная
                                информация, которую Пользователь предоставляет о себе самостоятельно
                                для совершения акцепта.
                            </p>
                            <p>
                                6.2.Правообладатель гарантирует конфиденциальность в отношении
                                персональных данных Пользователя и предоставляет доступ к
                                персональным данным только тем сотрудникам, которым эта информация
                                необходима для выполнения условий Соглашения, обеспечивая соблюдение
                                указанными лицами конфиденциальности персональных данных и
                                безопасности персональных данных при их обработке. Также
                                Правообладатель обязуется сохранять конфиденциальность всех
                                сведений, полученных от Пользователей, независимо от содержания
                                таких сведений и способов их получения.
                            </p>
                            <p>
                                6.3. В случаях утери Пользователем идентификационных данных (пароля)
                                для доступа к Личному кабинету, Пользователь может восстановить
                                пароль посредством нажатия кнопки «Забыли пароль?», расположенной на
                                главной странице по следующим адресам: http://gotruenet.com/
                                http://gotruenet.com/;
                                <Link to="#">http://gotruenet.com/</Link>;
                                <Link to="#">http://gotruenet.ru/</Link>;
                                <Link to="#">http://gotruenet.in/</Link>;
                                <Link to="#">http://gotruenet.net/</Link>;
                                <Link to="#">http://gotruenet.cn/</Link>;
                                <Link to="#">http://gotruenet.eu/</Link>в разделе «Личный кабинет» и
                                произведения дальнейших шагов по идентификации себя как Пользователя
                                и смены пароля.
                            </p>
                            <p>
                                6.4. Полученная Правообладателем информация (персональные данные) не
                                подлежит разглашению, за исключением случаев, когда ее раскрытие
                                является обязательным по законодательству Российской Федерации или
                                необходимо для работы Сайта и его функций.
                            </p>
                        </div>
                    </div>
                    <div className="popup-policy-block">
                        <div className="popup-policy-block__title">7.Ответственность сторон</div>
                        <div className="popup-policy-block__text">
                            <p>
                                7.1.Стороны несут ответственность за неисполнение или ненадлежащее
                                исполнение своих обязательств в соответствии с законодательством
                                России.
                            </p>
                            <p>
                                7.2. Правообладатель не принимает на себя ответственность за
                                соответствие Сайта целям использования.
                            </p>
                            <p>
                                7.3. Правообладатель не несет ответственности за технические перебои
                                в работе Сайта. Вместе с тем Правообладатель обязуется принимать все
                                разумные меры для предотвращения таких перебоев.
                            </p>
                            <p>
                                7.4. Правообладатель не несет ответственности за любые действия
                                Пользователя, связанные с использованием предоставленных прав
                                использования Сайта; за ущерб любого рода, понесенный Пользователем
                                из-за утери и/или разглашения своих данных либо в процессе
                                использования Сайта.
                            </p>
                            <p>
                                7.5.В случае если какое-либо третье лицо предъявляет Правообладателю
                                претензию в связи с нарушением Пользователем Соглашения либо
                                действующих законодательных норм, нарушением Пользователем прав
                                третьих лиц (в том числе прав на интеллектуальную собственность),
                                Пользователь обязуется компенсировать Правообладателю все расходы и
                                потери, в том числе оплатить любые компенсации и прочие затраты,
                                связанные с такой претензией.
                            </p>
                            <p>
                                7.6. Правообладатель не несет ответственности за содержание
                                сообщений или материалов Пользователей Сайта (пользовательский
                                контент), любые мнения, рекомендации или советы, содержащиеся в
                                таком контенте. Правообладатель не осуществляет предварительную
                                проверку содержания, подлинности и безопасности этих материалов либо
                                их компонентов, а равно их соответствия требованиям применимого
                                права, и наличия у Пользователей необходимого объема прав на их
                                использование в обязательном порядке.
                            </p>
                        </div>
                    </div>
                    <div className="popup-policy-block">
                        <div className="popup-policy-block__title">8.Разрешение споров</div>
                        <div className="popup-policy-block__text">
                            <p>
                                8.1.Претензионный порядок досудебного урегулирования споров,
                                вытекающих из настоящего Соглашения, является для Сторон
                                обязательным.
                            </p>
                            <p>
                                8.2.Претензионные письма направляются Сторонами нарочным либо
                                заказным почтовым отправлением с уведомлением о вручении по адресу
                                местонахождения Стороны.
                            </p>
                            <p>
                                8.3. Направление Сторонами претензионных писем иным способом, чем
                                указано в п. 8.2 Соглашения, не допускается.
                            </p>
                            <p>
                                8.4. Срок рассмотрения претензионного письма составляет 30 рабочих
                                дней со дня получения последнего адресатом.
                            </p>
                            <p>
                                8.5.Споры по настоящему Соглашению разрешаются в судебном порядке в
                                соответствии с законодательством.
                            </p>
                        </div>
                    </div>
                    <div className="popup-policy-block">
                        <div className="popup-policy-block__title">9.Заключительные положения</div>
                        <div className="popup-policy-block__text">
                            <p>
                                9.1. Настоящее Соглашение регулируется и толкуется в соответствии с
                                законодательством Российской Федерации. Вопросы, не урегулированные
                                настоящим Соглашением, подлежат разрешению в соответствии с
                                законодательством Российской Федерации. Все возможные споры,
                                вытекающие из отношений, регулируемых настоящим Соглашением,
                                разрешаются в порядке, установленном действующим законодательством
                                Российской Федерации, по нормам российского права. Везде по тексту
                                настоящего Соглашения под термином «законодательство» понимается
                                законодательство Российской Федерации.
                            </p>
                        </div>
                    </div>
                    <div className="popup-policy-block">
                        <div className="popup-policy-block__title">
                            10.Адреса и реквизиты сторон
                        </div>
                        <div className="popup-policy-block__text">
                            <p>
                                10.1. Правообладатель: почтовый адрес – Новосибирск, ул. Вилюйская
                                11-234; тел. – +79232213994; e-mail – gotruenet@gmail.com.
                            </p>
                        </div>
                    </div>
                </div>
            </div>
        </div>
    </div>
);

export default PopupRegisterAgreement;
